OctopodaSolutions/MCA_PIC32/MCA_Developing_V1.0/newmainXC16.c
//============================================================================
//Reference Command
//============================================================================
//MCS,10,500,20,250,1024,4,5,40,30,1,25,1.5,1,1,1,0,500,1,40


//============================================================================
// Configuration Bits
//============================================================================
#pragma config FNOSC = FRCPLL    // Internal Fast RC oscillator with PLL
#pragma config FSOSCEN = OFF     // Secondary Oscillator Disable
#pragma config POSCMOD = OFF     // Primary oscillator disabled
#pragma config OSCIOFNC = OFF    // CLKO Output Signal Disable
#pragma config FPBDIV = DIV_1    // Peripheral Bus Clock = System Clock
#pragma config FWDTEN = OFF      // Watchdog Timer Disable
#pragma config WDTPS = PS1       // Watchdog Timer Postscale
#pragma config FCKSM = CSDCMD    // Clock Switching & Fail Safe Clock Monitor Disable
#pragma config ICESEL = ICS_PGx1 // ICE/ICD Comm Channel Select
#pragma config PWP = OFF         // Program Flash Write Protect Disable
#pragma config BWP = OFF         // Boot Flash Write Protect Disable
#pragma config CP = OFF          // Code Protect Disable
#pragma config FPLLMUL = MUL_15  // PLL Multiplier (15x)
#pragma config FPLLIDIV = DIV_2  // PLL Input Divider (2x Divider)
#pragma config FPLLODIV = DIV_1  // PLL Output Divider (1x Divider)

//============================================================================
// Includes
//============================================================================
#include <xc.h>
#include <sys/attribs.h>  // Required for __ISR macro
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "device_info.h"
#include "status.h"

//============================================================================
// Defines
//============================================================================
#define SYSCLK      60000000L
#define PBCLK       60000000L
#define UART_BAUD   115200
#define I2C_FREQ    100000  // 100kHz I2C frequency
#define DAC_ADDR    0x48    // DAC8571 I2C address (A0 = 0)
//#define PGA_ADDR    0x60    // PGA I2C address (example, adjust as needed)
#define CMD_SIZE    64
#define RESPONSE_SIZE 512
#define I2C_TIMEOUT 10000
//============================================================================
// Global Variables
//============================================================================
char cmdBuffer[CMD_SIZE];
unsigned int cmdIndex = 0;
bool dacConnected = false;
bool pgaConnected = false;  // For PGA connection status
bool continuousFPGARead = false;
#define EEPROM_CS   LATCbits.LATC2

extern SystemStatus status;


//============================================================================
// Function Prototypes
//============================================================================
void SYSTEM_Init(void);
void GPIO_Init(void);
void UART1_Init(void);
void UART2_Init(void);
void I2C2_Init(void);
//void I2C2_Start(void);
//void I2C2_Stop(void);
//void I2C2_Write(unsigned char data);
unsigned char I2C2_Read(unsigned char ack);
void setDAC_Voltage(unsigned int voltage);
unsigned int getDAC_Voltage(void);
void sendFPGA_Command(const char* cmd, unsigned int value);
void processCommand(const char* cmd);
bool checkDAC_Connection(void);
void delay_ms(unsigned int ms);
void performPOR(void);

// UART2 function prototypes
void UART2_Write(unsigned char data);
void UART2_WriteString(const char* str);
unsigned char UART2_DataReady(void);
char UART2_Read(void);

// SPI Functions for 25LC640A EEPROM
void SPI_Init(void);
unsigned char SPI_Transfer(unsigned char data);
void EEPROM_WriteEnable(void);
void EEPROM_WriteDisable(void);
unsigned char EEPROM_ReadStatus(void);
void EEPROM_WriteStatus(unsigned char status);
void EEPROM_WriteByte(unsigned int address, unsigned char data);
unsigned char EEPROM_ReadByte(unsigned int address);
void EEPROM_WriteBytes(unsigned int address, unsigned char* data, unsigned int length);
void EEPROM_ReadBytes(unsigned int address, unsigned char* data, unsigned int length);

//============================================================================
// Utility Functions
//============================================================================
void delay_ms(unsigned int ms) {
    unsigned int i;
    unsigned int count = ms * (SYSCLK / 2000000);
    for(i = 0; i < count; i++) {
        asm("nop");
    }
}


void delay_us(unsigned int us) {
    unsigned int i;
    unsigned int count = us * (SYSCLK / 20000000);
    for (i = 0; i < count; i++) {
        asm("nop");
    }
}

//============================================================================
// 25LC640A EEPROM commands
//============================================================================
#define EEPROM_READ       0x03
#define EEPROM_WRITE      0x02
#define EEPROM_WRDI       0x04
#define EEPROM_WREN       0x06
#define EEPROM_RDSR       0x05
#define EEPROM_WRSR       0x01

//============================================================================
// System Initialization
//============================================================================
void SYSTEM_Init(void) {
    // Unlock system for clock configuration
    SYSKEY = 0;
    SYSKEY = 0xAA996655;
    SYSKEY = 0x556699AA;
    
    // Configure OSCCON
    OSCCONbits.NOSC = 0x0001;     // FRC with PLL
    OSCCONbits.FRCDIV = 0;        // FRC divider = 1
    OSCCONbits.PBDIV = 0;         // Peripheral bus clock = SYSCLK
    
    while(OSCCONbits.OSWEN != 0); // Wait for switch
    while(OSCCONbits.SLOCK != 1); // Wait for PLL lock
    
    SYSKEY = 0x33333333;          // Lock system configuration
}

void GPIO_Init(void) {
    // Unlock PPS
    SYSKEY = 0x00000000;
    SYSKEY = 0xAA996655;
    SYSKEY = 0x556699AA;
    
    // Configure UART1 pins
    TRISAbits.TRISA4 = 1;    // U1RX as input
    TRISAbits.TRISA0 = 0;    // U1TX as output
    
    // Configure UART2 pins
    TRISBbits.TRISB8 = 1;    // U2RX as input
    TRISBbits.TRISB9 = 0;    // U2TX as output
    
    // Configure I2C2 pins for DAC
    TRISBbits.TRISB3 = 0;    // SCL2
    TRISBbits.TRISB2 = 0;    // SDA2
    
