OctopodaSolutions/MCA_PIC32/MCA_Developing_V1.0/newmainXC16.c
    // Configure SPI2 pins for EEPROM
    TRISAbits.TRISA8 = 0;    // SDO2 (output)
    TRISCbits.TRISC2 = 0;    // SS2/CS (output)
    TRISBbits.TRISB15 = 0;   // SCK2 (output)
    TRISBbits.TRISB13 = 1;   // SDI2 (input)
    
    // Map pins
    U1RXR = 0b0010;          // RA4 -> U1RX
    RPA0R = 0b0001;          // RA0 -> U1TX
    
    U2RXR = 0b0100;          // RB8 -> U2RX
    RPB9R = 0b0010;          // RB9 -> U2TX
    
    // SPI2 PPS Mapping
    RPA8R = 0b0100;          // RA8 -> SDO2
    SDI2R = 0b0011;          // RB13 -> SDI2
    T2CKR = 0b0011;         // RB15 -> SCK2
    
    // Lock PPS
    SYSKEY = 0x33333333;
}
//============================================================================
// UART1 Initialization & Functions
//============================================================================
void UART1_Init(void) {
    // Disable UART1 before configuration
    U1MODEbits.ON = 0;
    
    // Clear UART1 configuration
    U1MODE = 0;
    U1STA = 0;
    
    // Calculate and set baud rate
    U1BRG = ((PBCLK / (16 * UART_BAUD)) - 1);
    
    // Configure UART1 mode
    U1MODEbits.BRGH = 0;      // Standard Speed mode
    U1MODEbits.PDSEL = 0;     // 8-bit data, no parity
    U1MODEbits.STSEL = 0;     // 1 stop bit
    
    // Enable TX and RX
    U1STAbits.UTXEN = 1;
    U1STAbits.URXEN = 1;
    
    // Enable UART1
    U1MODEbits.ON = 1;
    
    delay_ms(1);
}

void UART1_Write(unsigned char data) {
    while(U1STAbits.UTXBF);   // Wait until transmit buffer is not full
    U1TXREG = data;
    while(!U1STAbits.TRMT);   // Wait until transmit shift register is empty
}

void UART1_WriteString(const char* str) {
    while(*str != '\0') {
        UART1_Write(*str++);
    }
}

unsigned char UART1_DataReady(void) {
    return U1STAbits.URXDA;
}

char UART1_Read(void) {
    if(U1STAbits.OERR) {          // Clear overrun error
        U1STAbits.OERR = 0;
    }
    while(!U1STAbits.URXDA);      // Wait for data to be available
    return U1RXREG;               // Return received data
}

//============================================================================
// UART2 Initialization & Functions (FPGA)
//============================================================================
void UART2_Init(void) {
    // Disable UART2 before configuration
    U2MODEbits.ON = 0;
    
    // Clear UART2 configuration
    U2MODE = 0;
    U2STA = 0;
    
    // Calculate and set baud rate
    U2BRG = ((PBCLK / (16 * UART_BAUD)) - 1);
    
    // Configure UART2 mode
    U2MODEbits.BRGH = 0;      // Standard Speed mode
    U2MODEbits.PDSEL = 0;     // 8-bit data, no parity
    U2MODEbits.STSEL = 0;     // 1 stop bit
    
    // Enable TX and RX
    U2STAbits.UTXEN = 1;
    U2STAbits.URXEN = 1;
    
    // Enable UART2
    U2MODEbits.ON = 1;
    
    delay_ms(1);
}

void UART2_Write(unsigned char data) {
    while(U2STAbits.UTXBF);   // Wait until transmit buffer is not full
    U2TXREG = data;
    while(!U2STAbits.TRMT);   // Wait until transmit shift register is empty
}

void UART2_WriteString(const char* str) {
    while(*str != '\0') {
        UART2_Write(*str++);
    }
}

unsigned char UART2_DataReady(void) {
    return U2STAbits.URXDA;
}

char UART2_Read(void) {
    if(U2STAbits.OERR) {          // Clear overrun error
        U2STAbits.OERR = 0;
    }
    while(!U2STAbits.URXDA);      // Wait for data to be available
    return U2RXREG;               // Return received data
}

//============================================================================
// I2C2 Initialization & Functions (for DAC)
//============================================================================
//============================================================================
// I2C2 Implementation
//============================================================================
void I2C2_Init(void) {
    I2C2CON = 0;
    I2C2BRG = (PBCLK / (2 * I2C_FREQ)) - 2;  // 100 kHz
    I2C2CONbits.DISSLW = 1;  // Disable slew rate for 100 kHz
    I2C2CONbits.ON = 1;
    
    LATBbits.LATB2 = 1;  // SDA high (idle)
    LATBbits.LATB3 = 1;  // SCL high (idle)
    delay_us(5);
}

bool I2C2_Start(void) {
    unsigned int timeout = I2C_TIMEOUT;
    I2C2CONbits.SEN = 1;
    while (I2C2CONbits.SEN && --timeout);
    if (timeout == 0 || I2C2STATbits.BCL) {
        I2C2CONbits.ON = 0;  // Reset I2C module on error
        delay_us(5);
        I2C2CONbits.ON = 1;
        return false;
    }
    delay_us(5);  // tHD;STA ≥ 4 µs
    return true;
}

bool I2C2_Restart(void) {
    unsigned int timeout = I2C_TIMEOUT;
    I2C2CONbits.RSEN = 1;
    while (I2C2CONbits.RSEN && --timeout);
    if (timeout == 0 || I2C2STATbits.BCL) {
        I2C2CONbits.ON = 0;
        delay_us(5);
        I2C2CONbits.ON = 1;
        return false;
    }
    delay_us(5);
    return true;
}

bool I2C2_Stop(void) {
    unsigned int timeout = I2C_TIMEOUT;
    I2C2CONbits.PEN = 1;
    while (I2C2CONbits.PEN && --timeout);
    if (timeout == 0 || I2C2STATbits.BCL) {
        I2C2CONbits.ON = 0;
        delay_us(5);
        I2C2CONbits.ON = 1;
        return false;
    }
    delay_us(5);  // tSU;STO ≥ 4 µs
    return true;
}

bool I2C2_Write(unsigned char data) {
    unsigned int timeout = I2C_TIMEOUT;
    I2C2TRN = data;
    while (I2C2STATbits.TRSTAT && --timeout);
    if (timeout == 0 || I2C2STATbits.BCL) {
        I2C2CONbits.ON = 0;
        delay_us(5);
        I2C2CONbits.ON = 1;
        return false;
    }
    delay_us(5);
    return !I2C2STATbits.ACKSTAT;  // True if ACK, false if NACK
}

unsigned char I2C2_Read(unsigned char ack) {
    unsigned int timeout = I2C_TIMEOUT;
    I2C2CONbits.RCEN = 1;
    while (!I2C2STATbits.RBF && --timeout);
    if (timeout == 0 || I2C2STATbits.BCL) {
        I2C2CONbits.ON = 0;
        delay_us(5);
        I2C2CONbits.ON = 1;
        return 0;
    }
    unsigned char data = I2C2RCV;
    I2C2CONbits.ACKDT = !ack;  // 0 = ACK, 1 = NACK
    I2C2CONbits.ACKEN = 1;
    while (I2C2CONbits.ACKEN && --timeout);
    delay_us(5);
    return data;
}

//============================================================================
// DAC8571 Functions
//============================================================================
void setDAC_Voltage(unsigned int voltage) {
    if (voltage > 1000) voltage = 1000;
    if (voltage < 0) voltage = 0;

