OctopodaSolutions/MCA_PIC32/MCA_Developing_V1.0/newmainXC16.c
    unsigned int dac_value = (voltage * 65535UL) / 1000;

    for (int attempts = 0; attempts < 3; attempts++) {
        if (!I2C2_Start()) continue;
        if (!I2C2_Write(DAC_ADDR << 1)) {
            I2C2_Stop();
            delay_ms(10);
            continue;
        }
        I2C2_Write(0x10);  // Control byte: Store and update
        I2C2_Write((dac_value >> 8) & 0xFF);  // MSB
        I2C2_Write(dac_value & 0xFF);         // LSB
        I2C2_Stop();

        unsigned int read_voltage = getDAC_Voltage();
        if (abs(read_voltage - voltage) <= 2) {
            break;
        }
        delay_ms(10);
    }
}

unsigned int getDAC_Voltage(void) {
    unsigned int dac_value = 0;
    if (!I2C2_Start()) return 0;
    if (!I2C2_Write(DAC_ADDR << 1)) {
        I2C2_Stop();
        return 0;
    }
    I2C2_Write(0x90);  // Control byte: Read DAC
    if (!I2C2_Restart()) {
        I2C2_Stop();
        return 0;
    }
    if (!I2C2_Write((DAC_ADDR << 1) | 1)) {
        I2C2_Stop();
        return 0;
    }
    dac_value = I2C2_Read(1) << 8;  // MSB (ACK)
    dac_value |= I2C2_Read(0);      // LSB (NACK)
    I2C2_Stop();
    return (dac_value * 1000) / 65535;
}

bool checkDAC_Connection(void) {
    if (!I2C2_Start()) return false;
    bool connected = I2C2_Write(DAC_ADDR << 1);
    I2C2_Stop();
    return connected;
}

////============================================================================
//// PGA-Related Functions
////============================================================================
//void setPGA_Gain(void) {
//    // Map courseGain (0-63) to PGA gain steps (1, 2, 4, 8, 16, 32, 64, 128)
//    unsigned char gain_code;
//    unsigned int gain;
//    if(status.courseGain <= 1) gain = 1;
//    else if(status.courseGain <= 3) gain = 2;
//    else if(status.courseGain <= 7) gain = 4;
//    else if(status.courseGain <= 15) gain = 8;
//    else if(status.courseGain <= 31) gain = 16;
//    else if(status.courseGain <= 47) gain = 32;
//    else if(status.courseGain <= 63) gain = 64;
//    else gain = 128;  // Max gain if out of range
//
//    switch(gain) {
//        case 1:   gain_code = 0; break;
//        case 2:   gain_code = 1; break;
//        case 4:   gain_code = 2; break;
//        case 8:   gain_code = 3; break;
//        case 16:  gain_code = 4; break;
//        case 32:  gain_code = 5; break;
//        case 64:  gain_code = 6; break;
//        case 128: gain_code = 7; break;
//        default:  gain_code = 0;
//    }
//
//    I2C2_Start();
//    I2C2_Write(PGA_ADDR << 1);
//    I2C2_Write(0x00);  // Gain control register (adjust per PGA datasheet)
//    I2C2_Write(gain_code);
//    I2C2_Stop();
//}
//
//unsigned int getPGA_Gain(void) {
//    unsigned char gain_code;
//    I2C2_Start();
//    I2C2_Write(PGA_ADDR << 1);
//    I2C2_Write(0x00);
//    I2C2_Restart();
//    I2C2_Write((PGA_ADDR << 1) | 1);
//    gain_code = I2C2_Read(0);
//    I2C2_Stop();
//
//    switch(gain_code) {
//        case 0: return 1;
//        case 1: return 2;
//        case 2: return 4;
//        case 3: return 8;
//        case 4: return 16;
//        case 5: return 32;
//        case 6: return 64;
//        case 7: return 128;
//        default: return 1;
//    }
//}
//
//bool checkPGA_Connection(void) {
//    I2C2_Start();
//    I2C2_Write(PGA_ADDR << 1);
//    bool connected = !I2C2STATbits.ACKSTAT;
//    I2C2_Stop();
//    return connected;
//}



//============================================================================
// FPGA-Related Functions
//============================================================================
void sendFPGA_Command(const char* cmd, unsigned int value) {
    char fpga_cmd[32];
    sprintf(fpga_cmd, "%s,%u\r\n", cmd, value);
    UART2_WriteString(fpga_cmd);
}

void sendFPGA_SimpleCommand(const char* cmd) {
    UART2_WriteString(cmd);
    UART2_WriteString("\r\n");
}
// function to read a single value from FPGA 
// unsigned int readFPGA_Value(const char* cmd) {
//     // Implementation if needed...
//     return 0;
// }

void readFPGAData(void) {
    // Check if any data is available in UART2 buffer and forward it to UART1
    while(UART2_DataReady()) {
        char fpga_data = UART2_Read();
        UART1_Write(fpga_data);
    }
}

//============================================================================
// SPI Functions for 25LC640A I/P (EEPROM)
//============================================================================
void SPI_Init(void) {
    // Configure SPI1 for Master mode, mode 0 (CKP=0, CKE=1)
    SPI1CON = 0;              // Reset configuration
    SPI1STATCLR = 0x40;       // Clear overflow flag
    SPI1CONbits.MSTEN = 1;    // Enable Master mode
    SPI1CONbits.CKP = 0;      // Clock idle low
    SPI1CONbits.CKE = 1;      // Data is shifted out on the rising edge
    SPI1CONbits.SMP = 0;      // Input sampled at middle of data output time
    SPI1BRG = 1;              // Set baud rate (adjust as needed for EEPROM)
    SPI1CONbits.ON = 1;       // Enable SPI module
    
    // Initialize chip select pin
    EEPROM_CS = 1;            // Start with CS high (inactive)
}

unsigned char SPI_Transfer(unsigned char data) {
    SPI1BUF = data;
    while(!SPI1STATbits.SPIRBF);  // Wait until transfer complete
    return SPI1BUF;
}

void SPI_Write(unsigned char data) {
    SPI_Transfer(data);
}

unsigned char SPI_Read(void) {
    return SPI_Transfer(0xFF);  // Send dummy byte and return received data
}

void EEPROM_WriteEnable(void) {
    EEPROM_CS = 0;        // Assert CS (active low)
    SPI_Transfer(EEPROM_WREN);
    EEPROM_CS = 1;        // Deassert CS
}

void EEPROM_WriteDisable(void) {
    EEPROM_CS = 0;
    SPI_Transfer(EEPROM_WRDI);
    EEPROM_CS = 1;
}

unsigned char EEPROM_ReadStatus(void) {
    unsigned char status;
    EEPROM_CS = 0;
    SPI_Transfer(EEPROM_RDSR);
    status = SPI_Transfer(0xFF);
    EEPROM_CS = 1;
    return status;
}

void EEPROM_WriteStatus(unsigned char status) {
    EEPROM_WriteEnable();
    EEPROM_CS = 0;
    SPI_Transfer(EEPROM_WRSR);
    SPI_Transfer(status);
    EEPROM_CS = 1;
    
    // Wait for write to complete
    while(EEPROM_ReadStatus() & 0x01);
}

void EEPROM_WriteByte(unsigned int address, unsigned char data) {
    // Enable write operation
    EEPROM_WriteEnable();
    
    // Begin communication
    EEPROM_CS = 0;
    
    // Send write command followed by 16-bit address (MSB first)
    SPI_Transfer(EEPROM_WRITE);
    SPI_Transfer((address >> 8) & 0xFF);  // High byte of address
    SPI_Transfer(address & 0xFF);         // Low byte of address
    
