OctopodaSolutions/MCA_PIC32/MCA_Developing_V1.0/newmainXC16.c
    // Send data
    SPI_Transfer(data);
    
    // End communication
    EEPROM_CS = 1;
    
    // Wait for write to complete
    while(EEPROM_ReadStatus() & 0x01);
}

unsigned char EEPROM_ReadByte(unsigned int address) {
    unsigned char data;
    
    // Begin communication
    EEPROM_CS = 0;
    
    // Send read command followed by 16-bit address (MSB first)
    SPI_Transfer(EEPROM_READ);
    SPI_Transfer((address >> 8) & 0xFF);  // High byte of address
    SPI_Transfer(address & 0xFF);         // Low byte of address
    
    // Read data
    data = SPI_Transfer(0xFF);
    
    // End communication
    EEPROM_CS = 1;
    
    return data;
}

// Write multiple bytes to EEPROM (supports page writes)
void EEPROM_WriteBytes(unsigned int address, unsigned char* data, unsigned int length) {
    unsigned int i;
    unsigned int page_offset;
    unsigned int bytes_to_write;
    
    // Process data in chunks of page size (32 bytes for 25LC640A)
    while(length > 0) {
        // Calculate how many bytes we can write in current page
        page_offset = address % 32;
        bytes_to_write = 32 - page_offset;
        
        if(bytes_to_write > length) {
            bytes_to_write = length;
        }
        
        // Enable write operation
        EEPROM_WriteEnable();
        
        // Begin communication
        EEPROM_CS = 0;
        
        // Send write command followed by 16-bit address
        SPI_Transfer(EEPROM_WRITE);
        SPI_Transfer((address >> 8) & 0xFF);  // High byte of address
        SPI_Transfer(address & 0xFF);         // Low byte of address
        
        // Send data
        for(i = 0; i < bytes_to_write; i++) {
            SPI_Transfer(data[i]);
        }
        
        // End communication
        EEPROM_CS = 1;
        
        // Wait for write to complete
        while(EEPROM_ReadStatus() & 0x01);
        
        // Update variables for next page
        address += bytes_to_write;
        data += bytes_to_write;
        length -= bytes_to_write;
    }
}

// Read multiple bytes from EEPROM
void EEPROM_ReadBytes(unsigned int address, unsigned char* data, unsigned int length) {
    unsigned int i;
    
    // Begin communication
    EEPROM_CS = 0;
    
    // Send read command followed by 16-bit address
    SPI_Transfer(EEPROM_READ);
    SPI_Transfer((address >> 8) & 0xFF);  // High byte of address
    SPI_Transfer(address & 0xFF);         // Low byte of address
    
    // Read data
    for(i = 0; i < length; i++) {
        data[i] = SPI_Transfer(0xFF);
    }
    
    // End communication
    EEPROM_CS = 1;
}

// Store system status to EEPROM
void saveStatus(void) {
    unsigned char buffer[128];  // Increased buffer size to hold larger status structure
    
    // Get the actual size of the structure
    size_t structSize = sizeof(SystemStatus);
    
    // Make sure buffer is large enough
    if (structSize > sizeof(buffer)) {
        UART1_WriteString("Error: Status structure too large for buffer\r\n");
        return;
    }
    
    // Copy status to buffer
    memcpy(buffer, &status, structSize);
    
    // Write status to EEPROM starting at address 0
    EEPROM_WriteBytes(0, buffer, structSize);
    
    char debugMsg[64];
    sprintf(debugMsg, "Saved status to EEPROM (size: %d bytes)\r\n", (int)structSize);
    UART1_WriteString(debugMsg);
}

// Load system status from EEPROM
void loadStatus(void) {
    unsigned char buffer[128];  // Increased buffer size to hold larger status structure
    
    // Get the actual size of the structure
    size_t structSize = sizeof(SystemStatus);
    
    // Make sure buffer is large enough
    if (structSize > sizeof(buffer)) {
        UART1_WriteString("Error: Status structure too large for buffer\r\n");
        return;
    }
    
    // Read status from EEPROM starting at address 0
    EEPROM_ReadBytes(0, buffer, structSize);
    
    // Copy data to status structure
    memcpy(&status, buffer, structSize);
    
    char debugMsg[64];
    sprintf(debugMsg, "Loaded status from EEPROM (size: %d bytes)\r\n", (int)structSize);
    UART1_WriteString(debugMsg);
}

//============================================================================
// Command Processing
//============================================================================
void processCommand(const char* cmd) {
    char command[16];
    char param1[16];
    char param2[16];
    unsigned int value;
    
    // Initialize parameters to empty strings
    command[0] = param1[0] = param2[0] = '\0';
    
    // Parse command and parameters
    sscanf(cmd, "%[^,],%[^,],%s", command, param1, param2);
    
    // Convert command to uppercase
    for(int i = 0; command[i]; i++) {
        if(command[i] >= 'a' && command[i] <= 'z') {
            command[i] = command[i] - 32;
        }
    }
    
    // System Control Commands
    if(strcmp(command, "START") == 0) {
//        status.systemState = 1;
        
        // Enable continuous FPGA data reading
        sendFPGA_SimpleCommand("start");
        readFPGAData();
        continuousFPGARead = true;
        
        UART1_WriteString("System started\r\n");
        updateAndPrintStatus(UART1_WriteString, &status, "systemState", 1);
    }
    else if(strcmp(command, "STOP") == 0) {
//        status.systemState = 0;
        
        // Disable continuous FPGA data reading
        continuousFPGARead = false;
        sendFPGA_SimpleCommand("stop");
        
        UART1_WriteString("System stopped\r\n");
        updateAndPrintStatus(UART1_WriteString, &status, "systemState", 0);
    }
    else if(strcmp(command, "RESET") == 0) {
        setDAC_Voltage(400);
        sendFPGA_Command("RST", 0);
        UART1_WriteString("System reset complete\r\n");
        printStatusUpdate(UART1_WriteString, &status);
    }
    else if(strcmp(command, "STATUS") == 0) {
//        loadStatus();
        printStatusUpdate(UART1_WriteString, &status);
    }
    // DAC Commands
    else if (strcmp(command, "SETV") == 0) {
        value = atoi(param1);
        if (value > 0 && value <= 1000) {
            setDAC_Voltage(value);
            updateAndPrintStatus(UART1_WriteString, &status, "voltage", value);
            char msg[64];
            sprintf(msg, "DAC Voltage set to: %u mV\r\n", value);
            UART1_WriteString(msg);
        } else {
            UART1_WriteString("Error: Voltage must be between 1 and 1000 mV\r\n");
        }
    }
    else if (strcmp(command, "GETV?") == 0) {
        value = getDAC_Voltage();
        char msg[64];
        sprintf(msg, "DAC Voltage: %u mV\r\n", value);
        UART1_WriteString(msg);
        updateAndPrintStatus(UART1_WriteString, &status, "voltage", value);
    }
    // PGA Commands
    else if(strcmp(command, "SETCG") == 0 || strcmp(command, "CG") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 63) {
            status.courseGain = value;  // Update status
//            setPGA_Gain();              // Set PGA gain based on courseGain
            updateAndPrintStatus(UART1_WriteString, &status, "courseGain", value);
            saveStatus();
        } else {
            UART1_WriteString("Error: Coarse gain must be between 0 and 63\r\n");
        }
    }
    else if(strcmp(command, "SETFG") == 0 || strcmp(command, "FG") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 255) {
            status.fineGain = value;    // Update status (optional use)
//            setPGA_Gain();              // Fine gain could refine courseGain if needed
            updateAndPrintStatus(UART1_WriteString, &status, "fineGain", value);
            saveStatus();
        } else {
            UART1_WriteString("Error: Fine gain must be between 0 and 255\r\n");
        }
    }
    // FPGA - ADC Gain Commands
    else if(strcmp(command, "SETCG") == 0 || strcmp(command, "CG") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 63) {
            sendFPGA_Command("CG", value);
            updateAndPrintStatus(UART1_WriteString, &status, "courseGain", value);
        } else {
            UART1_WriteString("Error: Course gain must be between 0 and 63\r\n");
        }
    }
    else if(strcmp(command, "SETFG") == 0 || strcmp(command, "FG") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 255) {
            sendFPGA_Command("FG", value);
            updateAndPrintStatus(UART1_WriteString, &status, "fineGain", value);
        } else {
            UART1_WriteString("Error: Fine gain must be between 0 and 255\r\n");
        }
    }
    else if(strcmp(command, "SETDG") == 0 || strcmp(command, "DG") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 255) {
            sendFPGA_Command("DG", value);
            updateAndPrintStatus(UART1_WriteString, &status, "digitalGain", value);
        } else {
            UART1_WriteString("Error: Digital gain must be between 0 and 255\r\n");
        }
    }
    // FPGA - ADC Polarity Command
    else if(strcmp(command, "SETPOL") == 0 || strcmp(command, "POL") == 0) {
        value = atoi(param2);
        if(value == 0 || value == 1) {
            sendFPGA_Command("POL", value);
            updateAndPrintStatus(UART1_WriteString, &status, "polarity", value);
        } else {
            UART1_WriteString("Error: Polarity must be 0 (negative) or 1 (positive)\r\n");
        }
    }
    // FPGA - Timing Commands
    else if(strcmp(command, "SETTT") == 0 || strcmp(command, "TT") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 1000) {
            sendFPGA_Command("TT", value);
            updateAndPrintStatus(UART1_WriteString, &status, "thresholdTime", value);
        } else {
            UART1_WriteString("Error: Threshold time must be between 0 and 1000 seconds\r\n");
        }
    }
    else if(strcmp(command, "SETRT") == 0 || strcmp(command, "RT") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 10000) {
            sendFPGA_Command("RT", value);
            updateAndPrintStatus(UART1_WriteString, &status, "riseTime", value);
        } else {
            UART1_WriteString("Error: Rise time must be between 0 and 10000 ns\r\n");
        }
    }
    else if(strcmp(command, "SETFT") == 0 || strcmp(command, "FT") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 10000) {
            sendFPGA_Command("FT", value);
            updateAndPrintStatus(UART1_WriteString, &status, "flatTime", value);
        } else {
            UART1_WriteString("Error: Flat time must be between 0 and 10000 ns\r\n");
        }
    }
    // FPGA - Signal Processing Commands
    else if(strcmp(command, "SETPZ") == 0 || strcmp(command, "PZ") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 1000) {
            sendFPGA_Command("PZ", value);
            updateAndPrintStatus(UART1_WriteString, &status, "poleZero", value);
        } else {
            UART1_WriteString("Error: Pole-zero must be between 0 and 1000\r\n");
        }
    }
    else if(strcmp(command, "SETDB") == 0 || strcmp(command, "DB") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 1000) {
            sendFPGA_Command("DB", value);
            updateAndPrintStatus(UART1_WriteString, &status, "digitalBL", value);
        } else {
            UART1_WriteString("Error: Digital baseline must be between 0 and 1000\r\n");
        }
    }
    else if(strcmp(command, "SETPR") == 0 || strcmp(command, "PR") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 100) {
            sendFPGA_Command("PR", value);
            updateAndPrintStatus(UART1_WriteString, &status, "pileupReject", value);
        } else {
            UART1_WriteString("Error: Pile-up reject must be between 0 and 100\r\n");
        }
    }
    else if(strcmp(command, "SETPT") == 0 || strcmp(command, "PT") == 0) {
        value = atoi(param2);
        if(value >= 0 && value <= 86400) {
            sendFPGA_Command("PT", value);
            updateAndPrintStatus(UART1_WriteString, &status, "presetTime", value);
        } else {
            UART1_WriteString("Error: Preset time must be between 0 and 86400 seconds\r\n");
        }
    }
    else if(strcmp(command, "INFO") == 0) {
        getDeviceInfo(UART1_WriteString);
    }
    else if(strcmp(command, "HELP") == 0) {
        UART1_WriteString("\r\nAvailable Commands:\r\n");
        // (Your help text here)
    } else if(strcmp(command, "SETC") == 0 || strcmp(command, "COUNT") == 0) {
        value = atoi(param2);
        // Optionally add bounds checking if needed
        sendFPGA_Command("COUNT", value);
        updateAndPrintStatus(UART1_WriteString, &status, "count", value);
    }
    // SETSCH,SCH,value set start channel
    else if(strcmp(command, "SETSCH") == 0 || strcmp(command, "SCH") == 0) {
        value = atoi(param2);
        sendFPGA_Command("SCH", value);
        updateAndPrintStatus(UART1_WriteString, &status, "startChannel", value);
    }
    // SETECH,ECH,Value set end channel
    else if(strcmp(command, "SETECH") == 0 || strcmp(command, "ECH") == 0) {
        value = atoi(param2);
        sendFPGA_Command("ECH", value);
        updateAndPrintStatus(UART1_WriteString, &status, "endChannel", value);
    }
    // SETCH,CH,Value  set number of channels (e.g., 1024, 2048, 4096, etc.)
    else if(strcmp(command, "SETCH") == 0 || strcmp(command, "CH") == 0) {
        value = atoi(param2);
        // You might want to restrict this to allowed values (1024, 2048, 4096, etc.)
        sendFPGA_Command("CH", value);
        updateAndPrintStatus(UART1_WriteString, &status, "channels", value);
    }
    // SETLLD,LLD,Value    set LLD value
    else if(strcmp(command, "SETLLD") == 0 || strcmp(command, "LLD") == 0) {
        value = atoi(param2);
        sendFPGA_Command("LLD", value);
        updateAndPrintStatus(UART1_WriteString, &status, "LLD", value);
    } else if(strcmp(command, "SETDT") == 0 || strcmp(command, "DT") == 0) {
        value = atoi(param2);
        // Optionally, you can add bounds checking for dwell time here.
        sendFPGA_Command("DT", value);
        updateAndPrintStatus(UART1_WriteString, &status, "dwellTime", value);
    }
    // SETULD,ULD,Value     set ULD value
    else if(strcmp(command, "SETULD") == 0 || strcmp(command, "ULD") == 0) {
        value = atoi(param2);
        sendFPGA_Command("ULD", value);
        updateAndPrintStatus(UART1_WriteString, &status, "ULD", value);
    }
    // SETHVON,ON,value   1 is HV on, 0 is HV off
    else if(strcmp(command, "SETHVON") == 0 || strcmp(command, "ON") == 0) {
        value = atoi(param2);
        if(value == 0 || value == 1) {
            sendFPGA_Command("ON", value);
            updateAndPrintStatus(UART1_WriteString, &status, "hvStatus", value);
        } else {
            UART1_WriteString("Error: HV status must be 0 (off) or 1 (on)\r\n");
        }
    }
}

void processModeCommand(const char *cmd) {
    char cmdCopy[CMD_SIZE];
    // Copy the input command into a modifiable buffer
    strncpy(cmdCopy, cmd, CMD_SIZE);
    cmdCopy[CMD_SIZE - 1] = '\0';  // Ensure null termination

    // Tokenize the command string using commas as delimiters.
    // Reserve up to 21 tokens (mode plus maximum parameters).
    char *tokens[21];
    int tokenCount = 0;
    char *token = strtok(cmdCopy, ",");
    while (token != NULL && tokenCount < 21) {
        tokens[tokenCount++] = token;
        token = strtok(NULL, ",");
    }

