OctopodaSolutions/MCA_PIC32/MCA_Developing_V1.0/newmainXC16.c
    if(tokenCount < 1) {
        UART1_WriteString("Error: No mode specified.\r\n");
        return;
    }

    // Check for mode selection (PHA or MCS)
    if(strcmp(tokens[0], "PHA") == 0) {
        // Expected 18 parameters after "PHA" (total tokens = 19)
        if(tokenCount != 19) {
            UART1_WriteString("Error: Incorrect number of parameters for PHA mode.\r\n");
            return;
        }
        int presetTime    = atoi(tokens[1]);
        int counts        = atoi(tokens[2]);
        int startChannel  = atoi(tokens[3]);
        int endChannel    = atoi(tokens[4]);
        int noOfChannels  = atoi(tokens[5]);
        int LLD           = atoi(tokens[6]);
        int ULD           = atoi(tokens[7]);
        int coarseGain    = atoi(tokens[8]);
        int fineGain      = atoi(tokens[9]);
        int inputPolarity = atoi(tokens[10]);
        int threshold     = atoi(tokens[11]);
        int riseTime      = atoi(tokens[12]);
        int flatTime      = atoi(tokens[13]);
        int poleZeros     = atoi(tokens[14]);
        int digitalBLR    = atoi(tokens[15]);
        int pileupReject  = atoi(tokens[16]);
        int HV            = atoi(tokens[17]);
        int HV_on_off     = atoi(tokens[18]);
        
        // Set mode first (don't print)
        updateAndPrintStatus(UART1_WriteString, &status, "!mode", 0); // 0 = PHA mode

        // Update system status with parsed values (don't print after each update)
        updateAndPrintStatus(UART1_WriteString, &status, "!presetTime", presetTime);
        updateAndPrintStatus(UART1_WriteString, &status, "!counts", counts);
        updateAndPrintStatus(UART1_WriteString, &status, "!startChannel", startChannel);
        updateAndPrintStatus(UART1_WriteString, &status, "!endChannel", endChannel);
        updateAndPrintStatus(UART1_WriteString, &status, "!noOfChannels", noOfChannels);
        updateAndPrintStatus(UART1_WriteString, &status, "!LLD", LLD);
        updateAndPrintStatus(UART1_WriteString, &status, "!ULD", ULD);
        updateAndPrintStatus(UART1_WriteString, &status, "!courseGain", coarseGain);
        updateAndPrintStatus(UART1_WriteString, &status, "!fineGain", fineGain);
        updateAndPrintStatus(UART1_WriteString, &status, "!inputPolarity", inputPolarity);
        updateAndPrintStatus(UART1_WriteString, &status, "!threshold", threshold);
        updateAndPrintStatus(UART1_WriteString, &status, "!riseTime", riseTime);
        updateAndPrintStatus(UART1_WriteString, &status, "!flatTime", flatTime);
        updateAndPrintStatus(UART1_WriteString, &status, "!poleZero", poleZeros);
        updateAndPrintStatus(UART1_WriteString, &status, "!digitalBLR", digitalBLR);
        updateAndPrintStatus(UART1_WriteString, &status, "!pileupReject", pileupReject);
        updateAndPrintStatus(UART1_WriteString, &status, "!voltage", HV);
        updateAndPrintStatus(UART1_WriteString, &status, "hvStatus", HV_on_off); // Print after last update

        UART1_WriteString("PHA mode configuration accepted.\r\n");
        saveStatus();
    }
    else if(strcmp(tokens[0], "MCS") == 0) {
        // Expected 19 parameters after "MCS" (total tokens = 20)
        if(tokenCount != 20) {
            UART1_WriteString("Error: Incorrect number of parameters for MCS mode.\r\n");
            return;
        }
        int presetTime    = atoi(tokens[1]);
        int counts        = atoi(tokens[2]);
        int startChannel  = atoi(tokens[3]);
        int endChannel    = atoi(tokens[4]);
        int noOfChannels  = atoi(tokens[5]);
        int LLD           = atoi(tokens[6]);
        int ULD           = atoi(tokens[7]);
        int coarseGain    = atoi(tokens[8]);
        int fineGain      = atoi(tokens[9]);
        int inputPolarity = atoi(tokens[10]);
        int threshold     = atoi(tokens[11]);
        int riseTime      = atoi(tokens[12]);
        int flatTime      = atoi(tokens[13]);
        int poleZeros     = atoi(tokens[14]);
        int digitalBLR    = atoi(tokens[15]);
        int pileupReject  = atoi(tokens[16]);
        int HV            = atoi(tokens[17]);
        int HV_on_off     = atoi(tokens[18]);
        int dwellTime     = atoi(tokens[19]);

        // Set mode first (don't print)
        updateAndPrintStatus(UART1_WriteString, &status, "!mode", 1); // 1 = MCS mode

        // Update system status with parsed values (don't print after each update)
        updateAndPrintStatus(UART1_WriteString, &status, "!presetTime", presetTime);
        updateAndPrintStatus(UART1_WriteString, &status, "!counts", counts);
        updateAndPrintStatus(UART1_WriteString, &status, "!startChannel", startChannel);
        updateAndPrintStatus(UART1_WriteString, &status, "!endChannel", endChannel);
        updateAndPrintStatus(UART1_WriteString, &status, "!noOfChannels", noOfChannels);
        updateAndPrintStatus(UART1_WriteString, &status, "!LLD", LLD);
        updateAndPrintStatus(UART1_WriteString, &status, "!ULD", ULD);
        updateAndPrintStatus(UART1_WriteString, &status, "!courseGain", coarseGain);
        updateAndPrintStatus(UART1_WriteString, &status, "!fineGain", fineGain);
        updateAndPrintStatus(UART1_WriteString, &status, "!inputPolarity", inputPolarity);
        updateAndPrintStatus(UART1_WriteString, &status, "!threshold", threshold);
        updateAndPrintStatus(UART1_WriteString, &status, "!riseTime", riseTime);
        updateAndPrintStatus(UART1_WriteString, &status, "!flatTime", flatTime);
        updateAndPrintStatus(UART1_WriteString, &status, "!poleZero", poleZeros);
        updateAndPrintStatus(UART1_WriteString, &status, "!digitalBLR", digitalBLR);
        updateAndPrintStatus(UART1_WriteString, &status, "!pileupReject", pileupReject);
        updateAndPrintStatus(UART1_WriteString, &status, "!voltage", HV);
        updateAndPrintStatus(UART1_WriteString, &status, "!hvStatus", HV_on_off);
        updateAndPrintStatus(UART1_WriteString, &status, "dwellTime", dwellTime); // Print after last update

        UART1_WriteString("MCS mode configuration accepted.\r\n");
        saveStatus();
    }
    else {
        UART1_WriteString("Error: Invalid mode specified. Use 'PHA' or 'MCS'.\r\n");
    }
}

//============================================================================
// Power-On Routine
//============================================================================
void performPOR(void) {
    // Initialize peripherals
    GPIO_Init();
    UART1_Init();
    UART2_Init();
    I2C2_Init();
    // SPI_Init();
    
    // Load saved status values first
    initStatus();
    
    // Debug output
    char debugStr[64];
    sprintf(debugStr, "Loaded voltage: %d\r\n", status.voltage);
    UART1_WriteString(debugStr);
    
    // Check connections (just for info display)
    dacConnected = checkDAC_Connection();
    
    UART1_WriteString("\r\nInitializing System:\r\n");
    
    // Always restore DAC voltage regardless of connection status
    setDAC_Voltage(status.voltage);
    sprintf(debugStr, "Restored Voltage: %d V\r\n", status.voltage);
    UART1_WriteString(debugStr);
    
    // Always restore all FPGA settings regardless of connection status
    sendFPGA_Command("CG", status.courseGain);    
    sendFPGA_Command("FG", status.fineGain);      
    sendFPGA_Command("DG", status.digitalGain);   
    sendFPGA_Command("POL", status.polarity);     
    sendFPGA_Command("TT", status.thresholdTime); 
    sendFPGA_Command("RT", status.riseTime);      
    sendFPGA_Command("FT", status.flatTime);      
    sendFPGA_Command("PZ", status.poleZero);      
    sendFPGA_Command("DB", status.digitalBL);     
    sendFPGA_Command("PR", status.pileupReject);  
    sendFPGA_Command("PT", status.presetTime);    
    
