OctopodaSolutions/MCA_PIC32/MCA_Developing_V1.0/newmainXC16.c
    // Just report connection status for information
    UART1_WriteString("DAC: ");
    UART1_WriteString(dacConnected ? "Connected\r\n" : "Not Connected\r\n");
    UART1_WriteString("PGA: ");
    UART1_WriteString(pgaConnected ? "Connected\r\n" : "Not Connected\r\n");
    
    UART1_WriteString("Power-On Reset complete\r\n");
    printStatusUpdate(UART1_WriteString, &status);
}

//============================================================================
// Main
//============================================================================
int main(void) {
    SYSTEM_Init();
    GPIO_Init();
    UART1_Init();
    UART2_Init();
    I2C2_Init();  
//     SPI_Init();
        // Just report connection status for information
    
    // Restore system status
    initStatus();
    
    // Initial message
    UART1_WriteString("\r\nPIC32 Control System Ready\r\n");
    UART1_WriteString("DAC: ");
    UART1_WriteString(dacConnected ? "Connected\r\n" : "Not Connected\r\n");
    UART1_WriteString("PGA: ");
    UART1_WriteString(pgaConnected ? "Connected\r\n" : "Not Connected\r\n");
    
    while(1) {
        // Check for incoming UART1 data character-by-character
        if(UART1_DataReady()) {
            char data = U1RXREG;
            
            // Echo received character back
            UART1_Write(data);
            
            // If newline or carriage return, process the command buffer
            if(data == '\r' || data == '\n') {
                if(cmdIndex > 0) {
                    cmdBuffer[cmdIndex] = '\0';
                    UART1_WriteString("\r\n");
                    
                    // Check if the command starts with "PHA" or "MCS" for full configuration
                    if(strncmp(cmdBuffer, "PHA", 3) == 0 || strncmp(cmdBuffer, "MCS", 3) == 0) {
                        processModeCommand(cmdBuffer);
                    } else {
                        processCommand(cmdBuffer);
                    }
                    
                    cmdIndex = 0;  // Reset the command buffer index
                }
            }
            else if(data == '\b' || data == 0x7F) {  // Handle backspace or delete
                if(cmdIndex > 0) {
                    cmdIndex--;
                    UART1_WriteString("\b \b");
                }
            }
            else if(cmdIndex < CMD_SIZE - 1) {
                cmdBuffer[cmdIndex++] = data;
            }
        }
        
        // Non-blocking FPGA data read if enabled
        if(continuousFPGARead == true) {
            readFPGAData();
        }        
    }
    
    return 0;
}